10/data/attachments/af91b114f366777d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:username>
            <nif:friendToBeAdded>Mathew_rich_Friend_51589_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>